export const heading1Desktop = 40;
export const heading1Mobile = 20;
export const heading1Tablet = 50;

export const heading2Desktop = 27;
export const heading2Mobile = 18;
export const heading2Tablet = 30;

export const heading3Desktop = 23;
export const heading3Mobile = 16;
export const heading3Tablet = 25;

export const cornerRadiusMobile = "5px";
export const cornerRadiusDesktopAndTablet = "10px";

export const shadowEffectTablet = "0 1px 20px 2px rgba(0, 0, 0, 0.25)";

export const shadowEffectMobile = "0 1px 10px 0 rgba(0, 0, 0, 0.25)";

export const shadowEffectDesktop = "0 1px 20px 1px rgba(0, 0, 0, 0.25)";

// use Color Highlight extension
export const colors = {
  mainColor: "#783BA2",
  secondaryColor: "#462576",
  green: "#00BE98",
  orange: "#FF6542",
  color5: "#EADAC1",
};

export const background = {
  green: { backgroundColor: "#00BE98" },
  orange: { backgroundColor: "#FF6542" },
};

// Define all data for landing page !

export const hero = [
  {
    primary_text:
      "تعمل الأكاديمية العربية للبرمجة كجسر يربط العقول التكنولوجية العربية في المهجر بالطلبة العرب أينما كانوا",
    secondary_text:
      "تقدم الأكاديمية العربية للبرمجة تجربة تعلم متميزة من خلال مجموعة من الدروس والمناهج الاحترافية بجودة عالية",
    secondary_text_mt:
      "وأسلوب تدريسي ممتع يتناسب مع مختلف الطرق التعليمية للمبتدئين والمحترفين بإشراف مدربين ومبرمجين ذوي خبرة عالمية في المجال التقني",
  },
];
export default hero;
export const courses = [
  {
    id: "1",
    name: "اسم الكورس",
    image: "/images/html.png",
    price: 24,
    trainer: "اسم المدرب",
    time: {
      vedio: 52,
      hours: 24,
      minutes: 45,
    },
  },
  {
    id: "2",
    name: "اسم الكورس",
    image: "/images/laravel.png",
    price: 24,
    trainer: "اسم المدرب",
    time: {
      vedio: 52,
      hours: 24,
      minutes: 45,
    },
  },

  {
    id: "3",
    name: "اسم الكورس",
    image: "/images/java.png",
    price: 24,
    trainer: "اسم المدرب",
    time: {
      vedio: 52,
      hours: 24,
      minutes: 45,
    },
  },

  {
    id: "4",
    name: "اسم الكورس",
    image: "/images/html.png",
    price: 24,
    trainer: "اسم المدرب",
    time: {
      vedio: 52,
      hours: 24,
      minutes: 45,
    },
  },
  {
    id: "5",
    name: "اسم الكورس",
    image: "/images/python.png",
    price: 24,
    trainer: "اسم المدرب",
    time: {
      vedio: 52,
      hours: 24,
      minutes: 45,
    },
  },
];

export const exams = [
  {
    title: "اختبر قدراتك",
    text: "تمكنك الأكاديمية العربية للبرمجة من اختبار مهاراتك البرمجية عبر الإنترنت بسهولة ومرونة. من خلال خدمة الامتحان البرمجي الإلكتروني",
    icon: "/icons/test_skills.png",
  },
  {
    title: "قم بالاختيار",
    text: "يمكنك اختيار اللغة البرمجية التي تود اختبار معرفتك بها، سواء كانت Python، Java، JavaScript أو أي لغة أخرى من اللغات المتاحة",
    icon: "/icons/code.png",
  },
  {
    title: "اعرف ترتيبك",
    text: "تيح لك لوحة الشرف معرفة ترتيبك بين الطلاب الذين اجتازوا الامتحان، مما يمنحك فرصة مميزة للتميز والإشادة بإنجازك أمام المجتمع الأكاديمي وزملائك",
    icon: "/icons/test_skills.png",
  },
];

// const exams = [
//   {
//     title: "اختبر قدراتك",
//     text: "تمكنك الأكاديمية العربية للبرمجة من اختبار مهاراتك البرمجية عبر الإنترنت بسهولة ومرونة. من خلال خدمة الامتحان البرمجي الإلكتروني",
//     icon: "/icons/test_skills.png",
//   },
//   {
//     title: "قم بالاختيار",
//     text: "يمكنك اختيار اللغة البرمجية التي تود اختبار معرفتك بها، سواء كانت Python، Java، JavaScript أو أي لغة أخرى من اللغات المتاحة",
//     icon: "/icons/code.png",
//   },
//   {
//     title: "اعرف ترتيبك",
//     text: "تيح لك لوحة الشرف معرفة ترتيبك بين الطلاب الذين اجتازوا الامتحان، مما يمنحك فرصة مميزة للتميز والإشادة بإنجازك أمام المجتمع الأكاديمي وزملائك",
//     icon: "/icons/test_skills.png",
//   },
// ];

// const texts = [
//   {
//     text_1:
//       "في الأكاديمية العربية للبرمجة، نسعى دائمًا إلى تقديم محتوى تعليمي يساهم في تمكين وتطوير مهارات المبرمجين الناطقين باللغة العربية. ومن هذا المنطلق، يهدف هذا القسم إلى تبسيط المفاهيم البرمجية لأي شخص، سواء كان مبتدئًا أو محترفًا، من فهمها واستيعابها بسهولة. نحرص على أن تكون الشروحات دقيقة وشاملة، مع توفير أمثلة عملية تساعد المتعلمين على تطبيق ما يتعلمونه بشكل فعّال.",
//     text_2:
//       "تتميز الأكاديمية العربية للبرمجة بتطوير أدوات تفاعلية وألعاب تعليمية مبتكرة باستخدام أساليب الـتلعيب Gamification، مما يجعل عملية التعلم أكثر متعة وجاذبية. نقدم حلولًا مخصصة تلبي احتياجات المؤسسات والشركات، حيث نساعد في تصميم تجارب تعليمية تفاعلية تعزز من تفاعل المستخدمين وتحفزهم على التعلم بطرق غير تقليدية. سواء كنت تبحث عن تطوير مهارات فريق العمل أو تقديم تجربة تعليمية فريدة لعملائك، الأكاديمية العربية للبرمجة هي شريكك المثالي لتحقيق هذه الأهداف بنجاح.",
//     text_3:
//       "الأكاديمية العربية للبرمجة تقدم تجربة تعليمية مميزة وفريدة تركز على إنتاج فيديوهات تعليمية بعناصر تفاعلية وشاملة تناسب جميع الفئات العمرية والمستويات. نسعى لتمكين كل فرد من تعلم البرمجة بطريقة مبسطة وممتعة، مع مراعاة احتياجات المتعلمين وتقديم محتوى يلهمهم للتفوق والإبداع. سواء كنت مبتدئًا أو محترفًا، ستجد لدينا ما يلهمك ويطور مهاراتك في عالم البرمجة، مع دعم مستمر وموارد غنية تواكب أحدث التقنيات والأساليب التعليمية.",
//   },
// ];

export const testimonal = [
  {
    user: "اسم المستخدم",
    text: "تقدم الأكاديمية العربية للبرمجة تجربة تعلم متميزة من خلال مجموعة من الدروس والمناهج الاحترافية بجودة عالية وأسلوب تدريسي ممتع يتناسب",
    stars: 4,
    date: "11 نيسان, 2023",
  },
  {
    user: "اسم المستخدم",
    text: "تقدم الأكاديمية العربية للبرمجة تجربة تعلم متميزة من خلال مجموعة من الدروس والمناهج الاحترافية بجودة عالية وأسلوب تدريسي ممتع يتناسب",
    stars: 4,
    date: "11 نيسان, 2023",
  },
  {
    user: "اسم المستخدم",
    text: "تقدم الأكاديمية العربية للبرمجة تجربة تعلم متميزة من خلال مجموعة من الدروس والمناهج الاحترافية بجودة عالية وأسلوب تدريسي ممتع يتناسب",
    stars: 4,
    date: "11 نيسان, 2023",
  },
];
